"""fill midle tasks

Revision ID: 6824aa6b05ec
Revises: 883bbb51afd3
Create Date: 2024-12-02 01:20:46.246068

"""
from typing import Sequence, Union

from alembic import op
import sqlalchemy as sa


# revision identifiers, used by Alembic.
revision: str = '6824aa6b05ec'
down_revision: Union[str, None] = '883bbb51afd3'
branch_labels: Union[str, Sequence[str], None] = None
depends_on: Union[str, Sequence[str], None] = None


def upgrade() -> None:
    op.execute(
        """
        INSERT INTO tasks (key_word, reward, type, button_name, text) VALUES
        ('видео', 15, 'midle', 'Видеообзор Школьного ученического самоуправления (ШУС)', '<b>Видеообзор Школьного ученического самоуправления (ШУС)</b>
Команде необходимо создать видеообзор, в котором команда ШУС ответит на несколько ключевых вопросов о своей деятельности. Видео должно быть информативным, логичным и креативным, а в его создании должны активно участвовать все члены команды.

<b>Требования:</b>
1. В видеообзоре нужно ответить на следующие вопросы:
• Представление команды ШУС: представьте каждого члена команды и их роли.
• Что такое ШУС? Краткое объяснение сути и целей органа ШУС.
• Описание структуры ШУС. Расскажите о том, как организовано ваше самоуправление.
• Описание деятельности ШУС. Поделитесь основными направлениями работы и инициативами в вашей образовательной организации.
• Взаимодействие с администрацией и другими организациями. Расскажите о сотрудничестве, которое у вас есть.
2. Длительность ролика: от 1 до 1,5 минут.
3. Положение видео: горизонтальное.
4. Не допускается использование музыкальных композиций, созданных иностранными агентами, нежелательными исполнителями, а также содержащих нецензурную лексику или негативный подтекст.
5. Готовое видео следует разместить в официальной группе школы или группы ШУС с использованием хештега #Команда_ШУС2024. Ссылку на опубликованный пост необходимо отправить @shinshila_shus

<b>Критерии:</b>
1. Содержание (соответствует ли требованиям п.1, соответствует ли содержание теме, полноценно ли раскрыты ответы) – 0–4.
2. Участие всех членов команды (присутствуют ли все члены команды в кадре) – 0–3.
3. Техническое исполнение (качество записи звука и изображения, горизонтальная ориентация видео, отсутствие технических ошибок и сбоев) – 0–4.
4. Соблюдение требований п. 2, п. 3, п.4 – 0–3.
5. Публикация видеоролика (наличие поста в официальной группе школы или группы ШУС, использование хештега #Команда_ШУС2024) – 0–1.
6. Оригинальность (уникальность и креативность подхода к созданию видео) – 0–1.
7. Логичность и грамотность построения текста (не более двух речевых ошибок в тексте видео) – 0–1.

<b>Максимальное количество баллов:</b> 15 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.'),
        ('пост', 18, 'midle', 'Пост на тему «Для чего мне ШУС?»', '<b>Пост на тему «Для чего мне ШУС?»</b>
Каждому участнику команды необходимо написать пост о важности и значимости школьного ученического самоуправления (ШУС) в его жизни и образовательном процессе.

<b>Требования:</b>
1. Посты нужно опубликовать на личных страницах в социальной сети ВКонтакте с хештегом #Команда_ШУС2024. Ссылки на посты необходимо отправить @shinshila_shus.
2. К посту должны быть прикреплены фото-, видео- и/или аудиоматериалы от 2 до 9 штук.
3. Количество баллов зависит от количества членов команды, написавших пост.

<b>Критерии:</b>
1. Содержательность (ясность, выразительность написания и богатый словарный запас) – 0–6.
2. Грамотность (не более двух орфографических, речевых, пунктуационных и грамматических ошибок) - 4
2. Оригинальность и креативность (уникальный подход к теме, наличие личных историй и размышлений) – 0–4.
3. Наличие материалов: прикрепленные к посту фото и видео должны быть качественными и соответствовать теме – 0–4.

<b>Максимальное количество баллов:</b> 18 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.'),
        ('активность', 14, 'midle', 'Фоновая активность для школьников, 2 уровень', '<b>Фоновая активность для школьников</b>
Вам необходимо разработать и реализовать фоновую активность для одноклассников или других школьников, которая будет проводиться в стенах школы. Фоновая активность проводится с целью улучшения эмоционального состояние как обучающихся, так и сотрудников. Задание может включать различные формы, такие как стенды с оценкой эмоционального состояния, объявления с отрывными листочками и т. д.

<b>Требования:</b>
1. Направить описание активности по форме необходимо отправить @shinshila_shus с приложением фото- и видеоматериалов, демонстрирующих проведение фоновой активности.

<b>Критерии:</b>
1. Идея и концепция (оригинальность и новизна предложенной идеи, соответствие задачи улучшению комфорта и эмоционального состояния учащихся и сотрудников школы, практическая применимость и удобство реализации в условиях школы) – 0–5.
2. Оформление и визуализация (эстетический вид оформления, привлекательность и доступность для восприятия обучающимися разных возрастов, четкость и понятность представленной информации) – 0–3.
3. Документирование и отчетность (качественно и правильно заполненная форма) – 0–6.

<b>Максимальное количество баллов:</b> 14 баллов.
<b>Срок сдачи задания:</b> до 18:00 час. текущего дня.'),
        ('зарядка', 13, 'midle', 'Зарядка на большой перемене в школе, 2 уровень', '<b>Зарядка на большой перемене в школе</b>
Команде необходимо провести зарядку на большой перемене в школе.

<b>Требования:</b>
1. Зарядка должна состоять из 2 танцев-флешмобов, разработанных участниками Конкурса
2. В зарядке должны участвовать учащиеся минимум 2 классов
3. Не допускается использование музыкальных композиций, созданных иностранными агентами, нежелательными исполнителями, а также содержащих нецензурную лексику или негативный подтекст.
4. Необходимо предоставить видеоролик с зарядками, на которых четко видны все участники команды и участники зарядки.

<b>Критерии:</b>
1. Организация и подготовка (качество разработки танцевальных флешмобов, степень подготовленности участников команды, координация действий и четкость исполнения танца) – 0–6.
2. Участие и вовлечение (количество участвующих классов, активность и заинтересованность учеников во время зарядки) – 0–5.
3. Музыкальное сопровождение – 0–2.

<b>Максимальное количество баллов:</b> 13 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.'),
        ('клип', 10, 'midle', 'ВК-клип', '<b>ВК-клип</b>
Команде необходимо снять, смонтировать и выложить вертикальное видео. Видео может быть развлекательным, познавательным и т. д., но должно соответствовать теме школьного ученического самоуправления.

<b>Требования:</b>
1. Длительность: от 10 секунд до 1 минуты.
2. Положение видео: вертикальное.
3. Не допускается использование музыкальных композиций, созданных иностранными агентами, а также содержащих нецензурную лексику или негативный подтекст.
4. Готовое видео следует разместить в официальной группе школы или группы ШУС с использованием хештега #Команда_ШУС2024. Ссылку на опубликованный пост необходимо отправить @shinshila_shus.

<b>Критерии:</b>
1. Содержание (соответствует ли оно теме школьного ученического самоуправления) – 0–3.
2. Техническое исполнение (качество записи звука и изображения, вертикальная ориентация видео, отсутствие технических ошибок и сбоев) – 0–4
3. Соблюдение требований к продолжительности видеоролика (соответствует ли длительность ролика установленным параметрам) – 0–1.
4. Публикация видеоролика (наличие поста в официальной группе школы или группы ШУС, использование хештега #Команда_ШУС2024) – 0–1.
5. Оригинальность (уникальность и креативность подхода к созданию видео) – 0–1.

<b>Максимальное количество баллов:</b> 10 баллов.
<b>Срок сдачи задания:</b> до 18:00 текущего дня.'),
        ('началка', 15, 'midle', 'Досуг на перемене для школьников 1–4 классов', '<b>Досуг на перемене для школьников 1–4 классов</b>
Команде необходимо провести интересное и увлекательное мероприятие для учеников начальных классов (1–4) на перемене. Досуг должен быть рассчитан на время от 10 до 20 минут и включать в себя разнообразные игры и активности, способствующие сплочению и общению ребят.

<b>Требования:</b>
1. Длительность мероприятия: от 10 до 20 минут.
2. Записать 2 видеосообщения, отражающих деятельность на мероприятии, на них должна присутствовать вся команда. Видеосообщения необходимо отправить @shinshila_shus в момент проведения досуга. Перед первым видеосообщением необходимо написать название команды и задания.
3. Необходимо направить описание активности по форме @shinshila_shus с приложением фото-видеоматериалов, демонстрирующих проведение досуга.

<b>Критерии:</b>
1. Разнообразие и привлекательность активностей (включают ли мероприятие разнообразные игры и активности, соответствующие возрастным особенностям школьников) – 0–3.
2. Участие и вовлеченность учеников (степень активного участия школьников в мероприятие, интерес учеников на протяжении всего досуга) – 0–2.
3. Документирование и отчетность (качественно и правильно заполненная форма) – 0–6.
4. Выполнение требования записать два видеосообщения во время проведения мероприятия – 4.

<b>Максимальное количество баллов:</b> 15 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.'),
        ('досуг', 15, 'midle', 'Досуг на перемене для школьников 5–8 классов', '<b>Досуг на перемене для школьников 5–8 классов</b>
Команде необходимо провести интересное и увлекательное мероприятие для учеников средних классов (5–8 классы) на перемене. Досуг должен быть рассчитан на время от 10 до 20 минут и включать в себя разнообразные игры и активности, способствующие сплочению и общению ребят.

<b>Требования:</b>
1. Длительность мероприятия: от 10 до 20 минут.
2. Записать 2 видеосообщения, отражающих деятельность на мероприятии, на нем должна присутствовать вся команда. Видеосообщения необходимо отправить @shinshila_shus в момент проведения досуга. Перед первым видеосообщением необходимо написать название команды и задания.
3. Необходимо направить описание активности по форме @shinshila_shus с приложением фото-видеоматериалов, демонстрирующих проведение досуга.

<b>Критерии:</b>
1. Разнообразие и привлекательность активностей (включают ли мероприятие разнообразные игры и активности, соответствующие возрастным особенностям детей, интерес и увлекательность предлагаемых игр и занятий) – 0–3.
2. Участие и вовлеченность учеников (степень активного участия детей в мероприятиях, вовлеченность и интерес учеников на протяжении всего досуга) – 0–2.
3. Документирование и отчетность (качественно и правильно заполненная форма) – 0–6.
4. Выполнение требования записать два видеосообщения во время проведения мероприятия – 4.

<b>Максимальное количество баллов:</b> 15 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.'),
        ('старшие', 15, 'midle', 'Организация и проведение досуга на перемене для школьников 9–11 классов', '<b>Организация и проведение досуга на перемене для школьников 9–11 классов</b>
Команде необходимо провести интересное и увлекательное мероприятия для учеников средних классов (9–11 классы) на перемене. Досуг должен быть рассчитан на время от 10 до 20 минут и включать в себя разнообразные игры и активности, способствующие сплочению и общению ребят.

<b>Требования:</b>
1. Длительность мероприятия: от 10 до 20 минут.
2. Записать 2 видеосообщения, отражающих деятельность на мероприятии, на нем должна присутствовать вся команда. Видеосообщения необходимо отправить @shinshila_shus в момент проведения досуга. Перед первым видеосообщением необходимо написать название команды и задания.
3. Необходимо направить описание активности по форме @shinshila_shus с приложением фото-видеоматериалов, демонстрирующих проведение досуга.

<b>Критерии:</b>
1. Разнообразие и привлекательность активностей (включают ли мероприятие разнообразные игры и активности, соответствующие возрастным особенностям школьников) – 0–3.
2. Участие и вовлеченность учеников (степень активного участия школьников в мероприятие, интерес учеников на протяжении всего досуга) – 0–2.
3. Документирование и отчетность (качественно и правильно заполненная форма) – 0–6.
4. Выполнение требования записать два видеосообщения во время проведения мероприятия – 4–0

<b>Максимальное количество баллов:</b> 15 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.'),
        ('интервью', 14, 'midle', 'Интервью с наставником ШУС (педагогом)', '<b>Интервью с наставником ШУС (педагогом)</b>
Команде необходимо провести интервью с наставником ШУС в образовательной организации на тему «Школьное ученическое самоуправление».

<b>Требования:</b>
1. Основной темой разговора является «Школьное ученическое самоуправление». Вопросы должны касаться различных аспектов работы ШУС, его значимости, опыта наставника и т. д.
2. В интервью должно быть задано от 3 до 5 вопросов, направленных на раскрытие темы.
3. Необходимо сделать фотографию интервьюера вместе с наставником, а также подготовить другие фотографии, связанные с темой интервью.
4. После проведения интервью требуется создать пост в социальной сети ВКонтакте в сообществе вашего органа ШУС или на странице школы. Пост должен содержать:
o от 3 до 5 вопросов с ответами;
o фотографию интервьюера с наставником;
o дополнительные фотографии, относящиеся к теме поста;
o хештег #Команда_ШУС2024.
5. Ссылку на созданный пост необходимо отправить @shinshila_shus.

<b>Критерии:</b>
1. Оригинальность и содержание вопросов (оригинальность, глубина и разнообразие тематики вопросов, соответствие вопросов основной теме интервью («Школьное ученическое самоуправление») – 0–6.
2. Грамотность (не более двух орфографических, речевых, пунктуационных и грамматических ошибок) – 0–4.
3. Оформление поста (привлекательное и аккуратное оформление поста, соответствие требований к количеству вопросов (от 3 до 5) и наличие необходимых элементов (фотография интервьюера с наставником, дополнительные фотографии, хештег #Команда_ШУС2024) – 0–4.

<b>Максимальное количество баллов:</b> 14 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.'),
        ('реклама', 10, 'midle', 'Реклама ШУС', '<b>Реклама ШУС</b>
Команде необходимо создать рекламный материал для привлечения новых участников в орган ученического самоуправления. Реклама должна быть яркой, привлекательной и мотивирующей, чтобы заинтересовать школьников присоединиться к деятельности органа ученического самоуправления. Вид рекламы может быть в формате электронных баннеров, листовок, плакатов, видеороликов и т. д.

<b>Критерии оценки:</b>
1. Использование нестандартных идей и решений – 0–2.
2. Привлекательность и визуальная составляющая – 0–4.
3. Грамотность – 0–4.

<b>Максимальное количество баллов:</b> 10 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.'),
        ('чек-лист', 11, 'midle', 'Создание чек-листа с лайфхаками для школьников', '<b>Создание чек-листа с лайфхаками для школьников</b>
Команде необходимо создать чек-лист с лайфхаками для школьников, который будет полезен для улучшения учебной эффективности школьникв, организации их времени и повышения личной продуктивности. Чек-лист должен содержать практические советы и рекомендации, которые могут облегчить повседневную учебную деятельность школьников и помочь им справляться с задачами более эффективно. В чек листе должно быть не менее 5 пунктов. Чек-лист должен быть сделан в электронном формате (.doc, pdf, jpg).

<b>Критерии оценки</b>
1. Содержание, полезность советов и практическая применимость лайфхаков – 0–6.
2. Оформление и дизайн – 0–2.
3. Количество лайфхаков (не менее 3) – 0–3

<b>Максимальное количество баллов:</b> 11 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.'),
        ('анализ', 12, 'midle', 'Анализ деятельности своего органа ученического самоуправления', '<b>Анализ деятельности своего органа ученического самоуправления</b>
Форма анализа работы органа ученического самоуправления представляет собой документ, предназначенный для систематизации и оценки деятельности данного органа. Анализ помогает выявлять достижения и точки роста для дальнейшего развития. Работу необходимо сдать в формате doc или docx. Сделать анализ необходимо по форме ниже, анализ проводится за 2024 год.

<b>Форма анализа работы органа ученического самоуправления</b>
1. Общая информация
o Название школы: ______
o Состав органа ученического самоуправления: ______ (перечисляются члены органа, указывается количество);
o Обучающиеся каких классов входят в состав органа ученического самоуправления.
2. Цели и задачи
Опишите основные цели и задачи, которые были поставлены перед органом ученического самоуправления на анализируемый период.
3. Достижения
Перечислите все достигнутые результаты и успехи, которых удалось добиться за указанный период.
4. Проблемы и трудности, решения
Укажите возникшие сложности и препятствия, с которыми столкнулся орган самоуправления, и какие пути решения вы находили.
5. Оценка эффективности
Оцените степень выполнения поставленных задач и достижения целей.
6. Рекомендации
Предложите меры по улучшению работы органа ученического самоуправления.
7. Заключение
Краткое резюме по итогам анализа, включающее общие выводы и предложения на будущее.

<b>Критерии:</b>
1. Качество предоставленной информации – 0–7.
2. Корректность заполнения всех пунктов формы – 0–1.
3. Грамотность (не более двух орфографических, речевых, пунктуационных и грамматических ошибок) – 0–4.

<b>Максимальное количество баллов:</b> 12 баллов.
<b>Срок сдачи задания:</b> до 23:59 час. 12 декабря 2024 года.')
        """
    )


def downgrade() -> None:
    op.execute(
        """
        DELETE FROM tasks WHERE key_word IN (
'видео',
'пост',
'активность',
'зарядка',
'клип',
'началка',
'досуг',
'старшие',
'интервью',
'реклама',
'чек-лист',
'анализ'
)
        """
    )
