"""fill unknown tasks

Revision ID: d566ef386436
Revises: 6824aa6b05ec
Create Date: 2024-12-02 01:45:18.859263

"""
from typing import Sequence, Union

from alembic import op
import sqlalchemy as sa


# revision identifiers, used by Alembic.
revision: str = 'd566ef386436'
down_revision: Union[str, None] = '6824aa6b05ec'
branch_labels: Union[str, Sequence[str], None] = None
depends_on: Union[str, Sequence[str], None] = None


def upgrade() -> None:
    op.execute(
        """
        INSERT INTO tasks (key_word, reward, type, button_name, text) VALUES
        ('подписка', 1, '?', '?', '<b>Подписаться на сообщества «Содружества» в ВК</b>
Каждому члену команды необходимо подписаться на группы Содружества ВКонтакте и канал в Telegram

<b>Группы для подписки:</b>
1.Содружество (https://vk.com/vol_sodruga)
2.Молодежный грантовый офис (https://vk.com/vol_sodruga_grant)
3.Содружество.Семья (https://vk.com/volsemiya)
4.Форумы. Вологодская область (https://vk.com/rmolvo)
5. Студактив35 (https://vk.com/studaktiv35)
6. Региональный центр патриотического воспитания (https://vk.com/patriotika35_yunarmy35)
7. Ресурсный центр Провода (https://vk.com/provoda35)
8. Лидеры Содружества (https://vk.com/lidersodruzhestvo)
9. Содружество (https://t.me/upinfo_news)

<b>Требования:</b>
1. Каждый участник должен быть подписан на группы до окончания конкурса. В качестве подтверждения выполнения задания необходимо отправить id своих аккаунтов в ВК и в ТГ в личные сообщение шиншилле Сушке.

<b>Критерии:</b>
Все члены команды подписаны на все группы «Содружества» –? баллов.
<b>Срок сдачи задания:</b> до 23:59 ч. 12 декабря 2024 года.'),
        ('конкурс', 1, '?', '?', '<b>Предложение конкурснwания для интернет-конкурса «Команда #ШУС_ВО»</b>
Вам необходимо создать и предложить одно задание для интернет-конкурса «Команда #ШУС_ВО».

<b>Требования:</b>
- задание должно быть адаптировано для онлайн-формата конкурса;
- не должно повторять или копировать существующие задания конкурса;
- должно быть связано с деятельностью ШУСа и его целями;
- в течение одного дня можно отправить только одно задание;
- в описании задания должны присутствовать: описание задания, требования и критерии оценки. Готовый файл направить в личные сообщение шиншилле Сушке.

<b>Критерии:</b>
1. Задание соответствует требованиям - ? (0–10).
<b>Срок сдачи задания:</b> до 18:00 текущего дня.'),
        ('сплоченность', 1, '?', '?', '<b>Задание на сплоченность команды</b>
Задача команды, разработать и воплотить в течение конкурса инициативу, которая наглядно отразит сплоченность вашей команды.

<b>Пример инициативы:</b> одежда одного цвета у всех членов команды в течение 3-х дней. (данный пример уже нельзя использовать в рамках конкурса)

В зависимости от выбранного формата команда отправляет фотографии, круги, посты и пр. в личные сообщения шиншилле Сушке (@shinshila_shus).

<b>Критерии:</b>
Оригинальность – ?.
<b>Срок сдачи задания:</b> до 23:59 ч. 12 декабря 2024 года.')
        """
    )

    op.execute(
        """
        INSERT INTO tasks (key_word, reward, type, button_name, attachments, attachment_type, text) VALUES
('отличия', 1, '?', '?', 'AgACAgIAAxkBAAIB7mdOAAGL49CEtJ2wU9NWXDtp2YO1_QAC2-4xG8MecErrQca5f9D2jwEAAwIAA3kAAzYE AgACAgIAAxkBAAIB62dOAAGIbz60zB3R3NIg3s97K4nT5gAC2u4xG8MecErnZQeGsJkclgEAAwIAA3kAAzYE', 'img' '<b>Найти отличия на картинке</b>
Вам необходимо найти максимальное количество отличий на картинках.

<b>Критерии:</b> за каждый правильный ответ по ? балла.
<b>Срок сдачи задания:</b> до 23:59 ч. 12 декабря 2024 года.')
        """
    )


def downgrade() -> None:
    op.execute(
        """
        DELETE FROM tasks WHERE key_word IN (
'подписка',
'конкурс',
'сплоченность',
'отличия'
)
        """
    )
